index.org
# -*- mode: org; -*-

#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="assets/htmlize.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="assets/readtheorg.css"/>

#+HTML_HEAD: <script type="text/javascript" src="assets/jquery-2.1.4.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="assets/bootstrap.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="assets/jquery.stickytableheaders.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="assets/readtheorg.js"></script>

#+TITLE: GeekPlux's Wiki
#+AUTHOR: GeekPlux
# #+DATE: 2015-11-28 02:07:42
#+EMAIL: geekplux@gmail.com
#+DESCRIPTION: GeekPlux's wiki
#+KEYWORDS: wiki geekplux developer development code skill programmer programming

* Development

-  [[http://coolshell.cn/articles/4990.html][程序员技术练级攻略]]
-  [[http://blog.knownsec.com/Knownsec_RD_Checklist/v2.2.html][知道创宇研发技能表]]

--------------

** Web

-  [[https://developer.mozilla.org/zh-CN/learn#][学习如何制作网站]]
-  [[http://www.html5rocks.com/zh/tutorials/internals/howbrowserswork/][浏览器的工作原理]]
-  [[http://www.20thingsilearned.com/zh-CN][关于浏览器和网络的 20 项须知]]
-  [[http://ecomfe.duapp.com/][前端知识体系]]
-  [[https://developers.google.com/web/fundamentals/][Google Web Fundamentals]]
-  [[https://github.com/dypsilon/frontend-dev-bookmarks][一大波前端资源]]
-  [[http://coderlmn.github.io/code-standards/][前端代码规范 及 最佳实践]]

*** HTML&CSS

-  [[http://codeguide.bootcss.com/][编码规范 by @mdo]] - 编写灵活、稳定、高质量的 HTML 和 CSS 代码的规范
-  [[http://cssguidelin.es/][CSS Guidelines]] - High-level advice and guidelines for writing sane, manageable, scalable CSS
-  [[http://nec.netease.com/][网易前端规范]] - 真心不错

**** 技巧：

-  [[http://www.ruanyifeng.com/blog/2010/03/css_cookbook.html][CSS 使用技巧]]
-  [[http://www.ruanyifeng.com/blog/2010/03/cross-browser_css3_features.html][CSS3 常用功能的写法]]
-  [[http://www.ruanyifeng.com/blog/2014/02/css_transition_and_animation.html][CSS 动画简介]]
-  [[http://www.ruanyifeng.com/blog/2009/03/css_selectors.html][CSS 选择器笔记]]

**** 学习 CSS：

-  [[http://zh.learnlayout.com/][学习 CSS 布局]]
-  [[http://www.w3school.com.cn/][w3school]]
-  [[http://www.csszengarden.com/tr/chinese/][CSS 禅意花园]]
-  [[http://css.yukir.net/][编写易于管理及维护的 CSS 指导纲要]]

**** 手册：

-  [[http://css.doyoe.com/][CSS 参考手册]]

*** JavaScript

-  [[http://javascript.ruanyifeng.com/][JavaScript
   标准参考教程（alpha）]]
-  [[http://bonsaiden.github.io/JavaScript-Garden/zh/][JavaScript 秘密花园]]
-  [[http://ejohn.org/apps/learn/][Learning Advanced JavaScript]]
-  [[http://eloquentjavascript.net/2nd_edition/preview/][Eloquent
   JavaScript]]
-  [[http://speakingjs.com/es5/index.html][Speaking JavaScript]]
-  [[http://lab.abhinayrathore.com/jquery-standards/][jQuery Coding
   Standards & Best Practices]]
-  [[http://www.keyframesandcode.com/resources/javascript/deconstructed/jquery/][jQuery
   Deconstructed]]
-  [[http://www.cnblogs.com/TomXu/archive/2011/12/15/2288411.html][深入理解 JavaScript 系列]]
-  [[http://es6.ruanyifeng.com/][ECMAScript 6 入门]]

*** CoffeeScript

-  [[http://island205.github.io/tlboc/][CoffeeScript 中文手册]]
-  [[http://island205.github.io/coffeescript-cookbook.github.com/][CoffeeScript
   Cookbook]]
-  [[https://github.com/geekplux/coffeescript-style-guide][CoffeeScript
   最佳实践和编码惯例]]
-  [[http://autotelicum.github.io/Smooth-CoffeeScript/][Smooth
   CoffeeScript]]

--------------

** Node

-  [[http://www.nodebeginner.org/index-zh-cn.html][Node 入门]]
-  [[http://nqdeng.github.io/7-days-nodejs/][七天学会 NodeJS]]
-  [[https://github.com/alsotang/node-lessons][Node.js 包教不包会]]
-  [[http://nodeapi.ucdok.com/#/api/][Node.js API 中文版]]
-  [[http://nodeschool.io/][nodeschool]]
-  [[http://0532.gitbooks.io/nodejs/][the NodeJS]] -
   一本关于 nodejs 的文档
-  [[http://blog.fens.me/series-nodejs/][从零开始 nodejs 系列文章]]

** Ruby

-  [[http://saito.im/slide/ruby-new.html][Ruby 语言新手教程]]
-  [[https://ihower.tw/rails4/index.html][Ruby on Rails 實戰聖經]]
-  [[http://guides.ruby-china.org][Ruby on Rails 指南]]

** Shell

-  [[https://github.com/jlevy/the-art-of-command-line/blob/master/README-zh.md][命令行的艺术]]

** Android

-  [[http://developer.android.com/index.html][Android Developers]]
-  [[http://www.androidviews.net/][AndroidViews]]
-  [[http://www.apkbus.com/design/index.html][Android Design]]

--------------

** PHP

-  [[http://wulijun.github.io/php-the-right-way/][PHP 之道]]
-  [[http://www.php.net/manual/zh/][PHP 手册]]
-  [[https://phpbestpractices.org/][PHP Best Practices]]
-  [[http://phpbestpractices.justjavac.com/][PHP 最佳实践（译）]]

--------------

** Linux

-  [[http://vbird.dic.ksu.edu.tw/][鸟哥的 Linux 私房菜]]
-  [[http://hyperpolyglot.org/unix-shells#top][Unix Shells: Bash, Fish,
   Ksh, Tcsh, Zsh]]
-  [[http://www.commandlinefu.com/commands/browse][命令大全（commandlinefu）]]
-  [[http://linux.chinaitlab.com/special/linuxcom/Index.html][常用命令全集（chinaitlab）]]
-  [[http://www.waterlab.cn/hpc/upload/2010/6/LinuxCommand.pdf][常用命令]]

--------------

** Code Game

-  [[http://www.codewars.com/][codewars]]
-  [[http://www.topcoder.com/][Top Coder]]
-  [[http://codetank.alloyteam.com/][codetank]]

--------------

