index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2015-11-28 Sat 02:29 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>GeekPlux's Wiki</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="GeekPlux" />
<meta  name="description" content="GeekPlux's wiki"
 />
<meta  name="keywords" content="wiki geekplux developer development code skill programmer programming" />
<link rel="stylesheet" type="text/css" href="assets/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="assets/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">GeekPlux's Wiki</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline15">1. Development</a>
<ul>
<li><a href="#orgheadline7">1.1. Web</a>
<ul>
<li><a href="#orgheadline4">1.1.1. HTML&amp;CSS</a></li>
<li><a href="#orgheadline5">1.1.2. JavaScript</a></li>
<li><a href="#orgheadline6">1.1.3. CoffeeScript</a></li>
</ul>
</li>
<li><a href="#orgheadline8">1.2. Node</a></li>
<li><a href="#orgheadline9">1.3. Ruby</a></li>
<li><a href="#orgheadline10">1.4. Shell</a></li>
<li><a href="#orgheadline11">1.5. Android</a></li>
<li><a href="#orgheadline12">1.6. PHP</a></li>
<li><a href="#orgheadline13">1.7. Linux</a></li>
<li><a href="#orgheadline14">1.8. Code Game</a></li>
</ul>
</li>
<li><a href="#orgheadline16">2. 日语学习</a></li>
<li><a href="#orgheadline17">3. Vim 操作</a></li>
<li><a href="#orgheadline18">4. Redis</a></li>
<li><a href="#orgheadline39">5. Tools</a>
<ul>
<li><a href="#orgheadline26">5.1. General Tools</a></li>
<li><a href="#orgheadline27">5.2. Development Tools</a></li>
<li><a href="#orgheadline28">5.3. Git</a></li>
<li><a href="#orgheadline29">5.4. Emacs</a></li>
<li><a href="#orgheadline30">5.5. Vim</a></li>
<li><a href="#orgheadline31">5.6. Sublime Text</a></li>
<li><a href="#orgheadline34">5.7. Web Tools</a>
<ul>
<li><a href="#orgheadline32">5.7.1. JavaScript</a></li>
<li><a href="#orgheadline33">5.7.2. CSS</a></li>
</ul>
</li>
<li><a href="#orgheadline35">5.8. 浏览器</a></li>
<li><a href="#orgheadline36">5.9. Chrome</a></li>
<li><a href="#orgheadline37">5.10. OS X tool</a></li>
<li><a href="#orgheadline38">5.11. Windows tool</a></li>
</ul>
</li>
<li><a href="#orgheadline46">6. 阅读</a>
<ul>
<li><a href="#orgheadline40">6.1. 书籍资源</a></li>
<li><a href="#orgheadline41">6.2. News</a></li>
<li><a href="#orgheadline42">6.3. 社区</a></li>
<li><a href="#orgheadline43">6.4. 必看的博客</a></li>
<li><a href="#orgheadline44">6.5. 我是死较真</a></li>
<li><a href="#orgheadline45">6.6. 已读书单</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline15" class="outline-2">
<h2 id="orgheadline15"><span class="section-number-2">1</span> Development</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="http://coolshell.cn/articles/4990.html">程序员技术练级攻略</a></li>
<li><a href="http://blog.knownsec.com/Knownsec_RD_Checklist/v2.2.html">知道创宇研发技能表</a></li>
</ul>

<hr  />
</div>

<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7"><span class="section-number-3">1.1</span> Web</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li><a href="https://developer.mozilla.org/zh-CN/learn">学习如何制作网站</a></li>
<li><a href="http://www.html5rocks.com/zh/tutorials/internals/howbrowserswork/">浏览器的工作原理</a></li>
<li><a href="http://www.20thingsilearned.com/zh-CN">关于浏览器和网络的 20 项须知</a></li>
<li><a href="http://ecomfe.duapp.com/">前端知识体系</a></li>
<li><a href="https://developers.google.com/web/fundamentals/">Google Web Fundamentals</a></li>
<li><a href="https://github.com/dypsilon/frontend-dev-bookmarks">一大波前端资源</a></li>
<li><a href="http://coderlmn.github.io/code-standards/">前端代码规范 及 最佳实践</a></li>
</ul>
</div>

<div id="outline-container-orgheadline4" class="outline-4">
<h4 id="orgheadline4"><span class="section-number-4">1.1.1</span> HTML&amp;CSS</h4>
<div class="outline-text-4" id="text-1-1-1">
<ul class="org-ul">
<li><a href="http://codeguide.bootcss.com/">编码规范 by @mdo</a> - 编写灵活、稳定、高质量的 HTML 和 CSS 代码的规范</li>
<li><a href="http://cssguidelin.es/">CSS Guidelines</a> - High-level advice and guidelines for writing sane, manageable, scalable CSS</li>
<li><a href="http://nec.netease.com/">网易前端规范</a> - 真心不错</li>
</ul>
</div>

<ol class="org-ol"><li><a id="orgheadline1"></a>技巧：<br  /><div class="outline-text-5" id="text-1-1-1-1">
<ul class="org-ul">
<li><a href="http://www.ruanyifeng.com/blog/2010/03/css_cookbook.html">CSS 使用技巧</a></li>
<li><a href="http://www.ruanyifeng.com/blog/2010/03/cross-browser_css3_features.html">CSS3 常用功能的写法</a></li>
<li><a href="http://www.ruanyifeng.com/blog/2014/02/css_transition_and_animation.html">CSS 动画简介</a></li>
<li><a href="http://www.ruanyifeng.com/blog/2009/03/css_selectors.html">CSS 选择器笔记</a></li>
</ul>
</div></li>

<li><a id="orgheadline2"></a>学习 CSS：<br  /><div class="outline-text-5" id="text-1-1-1-2">
<ul class="org-ul">
<li><a href="http://zh.learnlayout.com/">学习 CSS 布局</a></li>
<li><a href="http://www.w3school.com.cn/">w3school</a></li>
<li><a href="http://www.csszengarden.com/tr/chinese/">CSS 禅意花园</a></li>
<li><a href="http://css.yukir.net/">编写易于管理及维护的 CSS 指导纲要</a></li>
</ul>
</div></li>

<li><a id="orgheadline3"></a>手册：<br  /><div class="outline-text-5" id="text-1-1-1-3">
<ul class="org-ul">
<li><a href="http://css.doyoe.com/">CSS 参考手册</a></li>
</ul>
</div></li></ol>
</div>

<div id="outline-container-orgheadline5" class="outline-4">
<h4 id="orgheadline5"><span class="section-number-4">1.1.2</span> JavaScript</h4>
<div class="outline-text-4" id="text-1-1-2">
<ul class="org-ul">
<li><a href="http://javascript.ruanyifeng.com/">JavaScript
标准参考教程（alpha）</a></li>
<li><a href="http://bonsaiden.github.io/JavaScript-Garden/zh/">JavaScript 秘密花园</a></li>
<li><a href="http://ejohn.org/apps/learn/">Learning Advanced JavaScript</a></li>
<li><a href="http://eloquentjavascript.net/2nd_edition/preview/">Eloquent
JavaScript</a></li>
<li><a href="http://speakingjs.com/es5/index.html">Speaking JavaScript</a></li>
<li><a href="http://lab.abhinayrathore.com/jquery-standards/">jQuery Coding
Standards &amp; Best Practices</a></li>
<li><a href="http://www.keyframesandcode.com/resources/javascript/deconstructed/jquery/">jQuery
Deconstructed</a></li>
<li><a href="http://www.cnblogs.com/TomXu/archive/2011/12/15/2288411.html">深入理解 JavaScript 系列</a></li>
<li><a href="http://es6.ruanyifeng.com/">ECMAScript 6 入门</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-4">
<h4 id="orgheadline6"><span class="section-number-4">1.1.3</span> CoffeeScript</h4>
<div class="outline-text-4" id="text-1-1-3">
<ul class="org-ul">
<li><a href="http://island205.github.io/tlboc/">CoffeeScript 中文手册</a></li>
<li><a href="http://island205.github.io/coffeescript-cookbook.github.com/">CoffeeScript
Cookbook</a></li>
<li><a href="https://github.com/geekplux/coffeescript-style-guide">CoffeeScript
最佳实践和编码惯例</a></li>
<li><a href="http://autotelicum.github.io/Smooth-CoffeeScript/">Smooth
CoffeeScript</a></li>
</ul>

<hr  />
</div>
</div>
</div>

<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8"><span class="section-number-3">1.2</span> Node</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li><a href="http://www.nodebeginner.org/index-zh-cn.html">Node 入门</a></li>
<li><a href="http://nqdeng.github.io/7-days-nodejs/">七天学会 NodeJS</a></li>
<li><a href="https://github.com/alsotang/node-lessons">Node.js 包教不包会</a></li>
<li><a href="http://nodeapi.ucdok.com/#/api/">Node.js API 中文版</a></li>
<li><a href="http://nodeschool.io/">nodeschool</a></li>
<li><a href="http://0532.gitbooks.io/nodejs/">the NodeJS</a> -
一本关于 nodejs 的文档</li>
<li><a href="http://blog.fens.me/series-nodejs/">从零开始 nodejs 系列文章</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9"><span class="section-number-3">1.3</span> Ruby</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li><a href="http://saito.im/slide/ruby-new.html">Ruby 语言新手教程</a></li>
<li><a href="https://ihower.tw/rails4/index.html">Ruby on Rails 實戰聖經</a></li>
<li><a href="http://guides.ruby-china.org/">Ruby on Rails 指南</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-3">
<h3 id="orgheadline10"><span class="section-number-3">1.4</span> Shell</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li><a href="https://github.com/jlevy/the-art-of-command-line/blob/master/README-zh.md">命令行的艺术</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline11" class="outline-3">
<h3 id="orgheadline11"><span class="section-number-3">1.5</span> Android</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li><a href="http://developer.android.com/index.html">Android Developers</a></li>
<li><a href="http://www.androidviews.net/">AndroidViews</a></li>
<li><a href="http://www.apkbus.com/design/index.html">Android Design</a></li>
</ul>

<hr  />
</div>
</div>

<div id="outline-container-orgheadline12" class="outline-3">
<h3 id="orgheadline12"><span class="section-number-3">1.6</span> PHP</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li><a href="http://wulijun.github.io/php-the-right-way/">PHP 之道</a></li>
<li><a href="http://www.php.net/manual/zh/">PHP 手册</a></li>
<li><a href="https://phpbestpractices.org/">PHP Best Practices</a></li>
<li><a href="http://phpbestpractices.justjavac.com/">PHP 最佳实践（译）</a></li>
</ul>

<hr  />
</div>
</div>

<div id="outline-container-orgheadline13" class="outline-3">
<h3 id="orgheadline13"><span class="section-number-3">1.7</span> Linux</h3>
<div class="outline-text-3" id="text-1-7">
<ul class="org-ul">
<li><a href="http://vbird.dic.ksu.edu.tw/">鸟哥的 Linux 私房菜</a></li>
<li><a href="http://hyperpolyglot.org/unix-shells#top">Unix Shells: Bash, Fish,
Ksh, Tcsh, Zsh</a></li>
<li><a href="http://www.commandlinefu.com/commands/browse">命令大全（commandlinefu）</a></li>
<li><a href="http://linux.chinaitlab.com/special/linuxcom/Index.html">常用命令全集（chinaitlab）</a></li>
<li><a href="http://www.waterlab.cn/hpc/upload/2010/6/LinuxCommand.pdf">常用命令</a></li>
</ul>

<hr  />
</div>
</div>
