index.org
* 日语学习
Entered on [2015-09-21 Mon 15:27]

日语由两部分构成：假名、真名（汉字）
假名又有两部分构成：平假名、片假名

平假名是由汉字草书简化演变而来，平时用的最多
片假名的发音和平假名一一对应，由汉字楷体偏旁演化而来，但是字形相对简单，主要用于：外来语、动植物、拟声词

还有一类：罗马字，即用英文表达日语发音

五十音前十个 あいうえお
* Vim 操作
Entered on [2015-10-17 Sat 15:51]

 [[file:~/.emacs.d/.cache/.tutor/evil-tutor-17102015.txt::===============================================================================]]

#+BEGIN_EXAMPLE

    % 在对应括号跳转
    :s/old/new 替换
    c change
    A 直接到行尾
    s 修改
    * 搜索
    . 重复上一条命令
    >G 缩进一格
    q 记录宏
    @ 提取宏

#+END_EXAMPLE
* Redis

Entered on [2015-11-27 Fri 00:54]

del 命令不支持通配符，但我们可以结合 Linux 的管道和 xargs 命令自己实现删除所有符合规则的键。比如要删除所有以“user:”开头的键，就可以执行 redis-cli keys "user:*" | xargs redis-cli del   。另外由于 del 命令支持多个键作为参数，所以还可以执行 redis-cli del `redis-cli keys "user:*"` 来达到同样的效果，但是性能更好。
* Tools
** General Tools
**** 效率

-  [[https://pomotodo.com/][番茄土豆]]
-  [[http://www.calm.com/][白噪音]]
-  [[http://www.rainymood.com/][白噪音]]

**** 生活

-  [[http://resume.github.io/][Github 简历生成]]
-  [[https://cvmkr.com/][简历生成]]
-  [[http://jianlidachu.com/welcome/][简历大厨]]
-  [[https://github.com/geekcompany/ResumeSample][Resume template for
   Chinese programmers]]
-  [[https://github.com/geekcompany/DeerResume][最好用的 MarkDown 在线简历工具]]
   - 可在线预览、编辑、设置访问密码和生成 PDF

**** 在线编辑器

-  [[http://www.zybuluo.com/mdeditor][Cmd Makrdown]]
-  [[http://benweet.github.io/stackedit/][StackEdit]]
-  [[http://notepad.cc][notepad.cc]] - 特别好用
-  [[https://www.office.com/start/default.aspx][Office Online]]
-  [[http://slid.es/][Slides]] - 制作在线 PPT
-  [[http://maxiang.info/][马克飞象]] -
   一款专为印象笔记打造的 Markdown 编辑器

**** Music

-  [[http://www.xiami.com/][虾米]]
-  [[http://ll.geli.org/user/login][Listen Later]]
-  [[http://www.luoo.net/][落网]]

**** 这是什么

-  [[https://code.google.com/p/smartladder/][聪明的梯子]]
-  [[http://www.shadowsocks.com/][Shadowsocks]]

**** 下载

-  [[http://www.torrentkitty.com/][Torrent Kitty]]

**** 其他

-  [[http://zhihuhelpbyyzy.sinaapp.com/][知乎助手]]

--------------

** Development Tools

** Git

-  [[http://rogerdudler.github.io/git-guide/index.zh.html][git -
   简明指南]] - 助你入门 git 的简明指南，木有高深内容 ;)
-  [[http://git-scm.com/book/zh/v1][pro git（中文版）]]
-  [[http://www.liaoxuefeng.com/wiki/0013739516305929606dd18361248578c67b8067c8c017b000][Git
   教程]]
-  [[http://gitref.org/zh/index.html][Git 参考手册]]
-  [[http://www-cs-students.stanford.edu/~blynn/gitmagic/intl/zh_cn/][Git
   指南]]
-  [[http://pcottle.github.io/learnGitBranching/][Learn Git Branching]]

** Emacs

-  [[https://github.com/syl20bnr/spacemacs][spacemacs]]
-  [[http://smacs.github.io/elisp/][Emacs Lisp 简明教程]]
-  [[http://emacsist.com][Emacsist]]

** Vim

-  [[http://coolshell.cn/articles/5426.html][简明 Vim 练级攻略]]
-  [[http://learnvimscriptthehardway.onefloweroneworld.com/][笨方法学 Vimscript]]
-  [[http://stackoverflow.com/questions/1218390/what-is-your-most-productive-shortcut-with-vim?page=1&tab=votes#tab-top][What
   is your most productive shortcut with Vim?]]
-  [[http://vimawesome.com/][Vim Awesome]] - a directory of Vim plugins
   sourced from GitHub
-  [[https://github.com/wklken/k-vim][vim 推荐配置]]

** Sublime Text

-  [[http://zh.lucida.me/blog/sublime-text-complete-guide/][Sublime Text
   全程指南]]
-  [[http://feliving.github.io/Sublime-Text-3-Documentation/][Sublime
   Text 3 文档]]
-  [[http://docs.sublimetext.tw/][Sublime Text 手冊]]

** Web Tools

-  [[http://jsfiddle.net/][JSFiddle]] - 在线展示 Web 代码效果
-  [[http://codepen.io/][CodePen]] - 同上
-  [[http://tool.lu/][iBox]] - 一系列在线小工具
-  [[http://lab.maltewassermann.com/viewport-resizer/][VIEWPORT
   RESIZER]] - 响应式开发测试

*** JavaScript

-  [[http://js2coffee.org/][Js2coffee]] - JS 转换为 CoffeeScript
-  [[http://www.jshint.com/][JSHint]]
-  [[http://www.jslint.com/][JSLint]]
-  [[https://www.codefellows.org/blogs/complete-list-of-javascript-tools][A
   List of Foundational JavaScript Tools]]

*** CSS

-  [[http://csslint.net/][CSS Lint]]
-  [[https://github.com/tkadauke/css_doc][css\_doc]] 写注释用
-  [[https://github.com/kneath/kss][kss]] 写注释用
-  [[http://www.getmarkman.com/][马克鳗]] - 高效的设计稿标注、测量工具

--------------

** 浏览器

** Chrome

-  [[https://chrome.google.com/webstore/detail/vimium/dbepggeogbaibhgnhhndojpepiihcmeb][Vimium]]
-  [[http://markdown-here.com/][Markdown Here]]
-  [[https://chrome.google.com/webstore/detail/onetab/chphlpgkkbolifaimnlloiipkdnihall][One
   Tab]]
-  [[https://chrome.google.com/webstore/detail/new-tong-wen-tang/ldmgbgaoglmaiblpnphffibpbfchjaeg][新同文堂]]
   - 繁简转换

