index.html

<div id="outline-container-orgheadline14" class="outline-3">
<h3 id="orgheadline14"><span class="section-number-3">1.8</span> Code Game</h3>
<div class="outline-text-3" id="text-1-8">
<ul class="org-ul">
<li><a href="http://www.codewars.com/">codewars</a></li>
<li><a href="http://www.topcoder.com/">Top Coder</a></li>
<li><a href="http://codetank.alloyteam.com/">codetank</a></li>
</ul>

<hr  />
</div>
</div>
</div>

<div id="outline-container-orgheadline16" class="outline-2">
<h2 id="orgheadline16"><span class="section-number-2">2</span> 日语学习</h2>
<div class="outline-text-2" id="text-2">
<p>
Entered on <span class="timestamp-wrapper"><span class="timestamp">[2015-09-21 Mon 15:27]</span></span>
</p>

<p>
日语由两部分构成：假名、真名（汉字）假名又有两部分构成：平假名、片假名
</p>

<p>
平假名是由汉字草书简化演变而来，平时用的最多片假名的发音和平假名一一对应，由汉字楷体偏旁演化而来，但是字形相对简单，主要用于：外来语、动植物、拟声词
</p>

<p>
还有一类：罗马字，即用英文表达日语发音
</p>

<p>
五十音前十个 あいうえお
</p>
</div>
</div>
<div id="outline-container-orgheadline17" class="outline-2">
<h2 id="orgheadline17"><span class="section-number-2">3</span> Vim 操作</h2>
<div class="outline-text-2" id="text-3">
<p>
Entered on <span class="timestamp-wrapper"><span class="timestamp">[2015-10-17 Sat 15:51]</span></span>
</p>

<p>
<a href="file:///Users/geekplux/.emacs.d/.cache/.tutor/evil-tutor-17102015.txt#MissingReference">file:///Users/geekplux/.emacs.d/.cache/.tutor/evil-tutor-17102015.txt#MissingReference</a>
</p>

<pre class="example">
% 在对应括号跳转
:s/old/new 替换
c change
A 直接到行尾
s 修改
* 搜索
. 重复上一条命令
&gt;G 缩进一格
q 记录宏
@ 提取宏
</pre>
</div>
</div>
<div id="outline-container-orgheadline18" class="outline-2">
<h2 id="orgheadline18"><span class="section-number-2">4</span> Redis</h2>
<div class="outline-text-2" id="text-4">
<p>
Entered on <span class="timestamp-wrapper"><span class="timestamp">[2015-11-27 Fri 00:54]</span></span>
</p>

<p>
del 命令不支持通配符，但我们可以结合 Linux 的管道和 xargs 命令自己实现删除所有符合规则的键。比如要删除所有以“user:”开头的键，就可以执行 redis-cli keys "user:*" | xargs redis-cli del   。另外由于 del 命令支持多个键作为参数，所以还可以执行 redis-cli del `redis-cli keys "user:*"` 来达到同样的效果，但是性能更好。
</p>
</div>
</div>
<div id="outline-container-orgheadline39" class="outline-2">
<h2 id="orgheadline39"><span class="section-number-2">5</span> Tools</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-orgheadline26" class="outline-3">
<h3 id="orgheadline26"><span class="section-number-3">5.1</span> General Tools</h3>
<div class="outline-text-3" id="text-5-1">
</div><ol class="org-ol"><li><a id="orgheadline19"></a>效率<br  /><div class="outline-text-5" id="text-5-1-0-1">
<ul class="org-ul">
<li><a href="https://pomotodo.com/">番茄土豆</a></li>
<li><a href="http://www.calm.com/">白噪音</a></li>
<li><a href="http://www.rainymood.com/">白噪音</a></li>
</ul>
</div></li>

<li><a id="orgheadline20"></a>生活<br  /><div class="outline-text-5" id="text-5-1-0-2">
<ul class="org-ul">
<li><a href="http://resume.github.io/">Github 简历生成</a></li>
<li><a href="https://cvmkr.com/">简历生成</a></li>
<li><a href="http://jianlidachu.com/welcome/">简历大厨</a></li>
<li><a href="https://github.com/geekcompany/ResumeSample">Resume template for
Chinese programmers</a></li>
<li><a href="https://github.com/geekcompany/DeerResume">最好用的 MarkDown 在线简历工具</a>
<ul class="org-ul">
<li>可在线预览、编辑、设置访问密码和生成 PDF</li>
</ul></li>
</ul>
</div></li>

<li><a id="orgheadline21"></a>在线编辑器<br  /><div class="outline-text-5" id="text-5-1-0-3">
<ul class="org-ul">
<li><a href="http://www.zybuluo.com/mdeditor">Cmd Makrdown</a></li>
<li><a href="http://benweet.github.io/stackedit/">StackEdit</a></li>
<li><a href="http://notepad.cc/">notepad.cc</a> - 特别好用</li>
<li><a href="https://www.office.com/start/default.aspx">Office Online</a></li>
<li><a href="http://slid.es/">Slides</a> - 制作在线 PPT</li>
<li><a href="http://maxiang.info/">马克飞象</a> -
一款专为印象笔记打造的 Markdown 编辑器</li>
</ul>
</div></li>

<li><a id="orgheadline22"></a>Music<br  /><div class="outline-text-5" id="text-5-1-0-4">
<ul class="org-ul">
<li><a href="http://www.xiami.com/">虾米</a></li>
<li><a href="http://ll.geli.org/user/login">Listen Later</a></li>
<li><a href="http://www.luoo.net/">落网</a></li>
</ul>
</div></li>

<li><a id="orgheadline23"></a>这是什么<br  /><div class="outline-text-5" id="text-5-1-0-5">
<ul class="org-ul">
<li><a href="https://code.google.com/p/smartladder/">聪明的梯子</a></li>
<li><a href="http://www.shadowsocks.com/">Shadowsocks</a></li>
</ul>
</div></li>

<li><a id="orgheadline24"></a>下载<br  /><div class="outline-text-5" id="text-5-1-0-6">
<ul class="org-ul">
<li><a href="http://www.torrentkitty.com/">Torrent Kitty</a></li>
</ul>
</div></li>

<li><a id="orgheadline25"></a>其他<br  /><div class="outline-text-5" id="text-5-1-0-7">
<ul class="org-ul">
<li><a href="http://zhihuhelpbyyzy.sinaapp.com/">知乎助手</a></li>
</ul>

<hr  />
</div></li></ol>
</div>

<div id="outline-container-orgheadline27" class="outline-3">
<h3 id="orgheadline27"><span class="section-number-3">5.2</span> Development Tools</h3>
</div>

<div id="outline-container-orgheadline28" class="outline-3">
<h3 id="orgheadline28"><span class="section-number-3">5.3</span> Git</h3>
<div class="outline-text-3" id="text-5-3">
<ul class="org-ul">
<li><a href="http://rogerdudler.github.io/git-guide/index.zh.html">git -
简明指南</a> - 助你入门 git 的简明指南，木有高深内容 ;)</li>
<li><a href="http://git-scm.com/book/zh/v1">pro git（中文版）</a></li>
<li><a href="http://www.liaoxuefeng.com/wiki/0013739516305929606dd18361248578c67b8067c8c017b000">Git
教程</a></li>
<li><a href="http://gitref.org/zh/index.html">Git 参考手册</a></li>
<li><a href="http://www-cs-students.stanford.edu/~blynn/gitmagic/intl/zh_cn/">Git
指南</a></li>
<li><a href="http://pcottle.github.io/learnGitBranching/">Learn Git Branching</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline29" class="outline-3">
<h3 id="orgheadline29"><span class="section-number-3">5.4</span> Emacs</h3>
<div class="outline-text-3" id="text-5-4">
<ul class="org-ul">
<li><a href="https://github.com/syl20bnr/spacemacs">spacemacs</a></li>
<li><a href="http://smacs.github.io/elisp/">Emacs Lisp 简明教程</a></li>
<li><a href="http://emacsist.com/">Emacsist</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline30" class="outline-3">
<h3 id="orgheadline30"><span class="section-number-3">5.5</span> Vim</h3>
<div class="outline-text-3" id="text-5-5">
<ul class="org-ul">
<li><a href="http://coolshell.cn/articles/5426.html">简明 Vim 练级攻略</a></li>
<li><a href="http://learnvimscriptthehardway.onefloweroneworld.com/">笨方法学 Vimscript</a></li>
<li><a href="http://stackoverflow.com/questions/1218390/what-is-your-most-productive-shortcut-with-vim?page=1&amp;tab=votes#tab-top">What
is your most productive shortcut with Vim?</a></li>
<li><a href="http://vimawesome.com/">Vim Awesome</a> - a directory of Vim plugins
sourced from GitHub</li>
<li><a href="https://github.com/wklken/k-vim">vim 推荐配置</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline31" class="outline-3">
<h3 id="orgheadline31"><span class="section-number-3">5.6</span> Sublime Text</h3>
<div class="outline-text-3" id="text-5-6">
<ul class="org-ul">
<li><a href="http://zh.lucida.me/blog/sublime-text-complete-guide/">Sublime Text
全程指南</a></li>
<li><a href="http://feliving.github.io/Sublime-Text-3-Documentation/">Sublime
Text 3 文档</a></li>
<li><a href="http://docs.sublimetext.tw/">Sublime Text 手冊</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline34" class="outline-3">
<h3 id="orgheadline34"><span class="section-number-3">5.7</span> Web Tools</h3>
<div class="outline-text-3" id="text-5-7">
<ul class="org-ul">
<li><a href="http://jsfiddle.net/">JSFiddle</a> - 在线展示 Web 代码效果</li>
<li><a href="http://codepen.io/">CodePen</a> - 同上</li>
<li><a href="http://tool.lu/">iBox</a> - 一系列在线小工具</li>
<li><a href="http://lab.maltewassermann.com/viewport-resizer/">VIEWPORT
RESIZER</a> - 响应式开发测试</li>
</ul>
</div>

<div id="outline-container-orgheadline32" class="outline-4">
<h4 id="orgheadline32"><span class="section-number-4">5.7.1</span> JavaScript</h4>
<div class="outline-text-4" id="text-5-7-1">
<ul class="org-ul">
<li><a href="http://js2coffee.org/">Js2coffee</a> - JS 转换为 CoffeeScript</li>
<li><a href="http://www.jshint.com/">JSHint</a></li>
<li><a href="http://www.jslint.com/">JSLint</a></li>
<li><a href="https://www.codefellows.org/blogs/complete-list-of-javascript-tools">A
List of Foundational JavaScript Tools</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline33" class="outline-4">
<h4 id="orgheadline33"><span class="section-number-4">5.7.2</span> CSS</h4>
<div class="outline-text-4" id="text-5-7-2">
<ul class="org-ul">
<li><a href="http://csslint.net/">CSS Lint</a></li>
<li><a href="https://github.com/tkadauke/css_doc">css\<sub>doc</sub></a> 写注释用</li>
<li><a href="https://github.com/kneath/kss">kss</a> 写注释用</li>
<li><a href="http://www.getmarkman.com/">马克鳗</a> - 高效的设计稿标注、测量工具</li>
</ul>

<hr  />
</div>
</div>
</div>
